In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame(
    {"key":["A","B","C","D"],"inv_val":[99,56,12,55],"acc":[1,2,3,4]}
)
df2 = pd.DataFrame(
    {"key":["E","B","C","Z"],"hel_ratio":[0.23,0.33,0.5,0.55],"acc":[66,67,88,33]}
)

In [5]:
df1

  key  inv_val  acc
0   A       99    1
1   B       56    2
2   C       12    3
3   D       55    4

In [6]:
df2

  key  hel_ratio  acc
0   E       0.23   66
1   B       0.33   67
2   C       0.50   88
3   Z       0.55   33

In [7]:
pd.merge(df1,df2,how = "left", on = "key")

  key  inv_val  acc_x  hel_ratio  acc_y
0   A       99      1        NaN    NaN
1   B       56      2       0.33   67.0
2   C       12      3       0.50   88.0
3   D       55      4        NaN    NaN

In [8]:
pd.merge(df1,df2,how = "right", on = "key")

  key  inv_val  acc_x  hel_ratio  acc_y
0   E      NaN    NaN       0.23     66
1   B     56.0    2.0       0.33     67
2   C     12.0    3.0       0.50     88
3   Z      NaN    NaN       0.55     33

In [9]:
df1.merge(df2,how = "right", on = "key")

  key  inv_val  acc_x  hel_ratio  acc_y
0   E      NaN    NaN       0.23     66
1   B     56.0    2.0       0.33     67
2   C     12.0    3.0       0.50     88
3   Z      NaN    NaN       0.55     33

## Stacking

In [17]:
df1 = pd.DataFrame(
    {"A":[1,2,3],"B":[0,9,8],"C":[2,6,0]},index = ["X","Y","Z"])

In [18]:
df1.stack()

X  A    1
   B    0
   C    2
Y  A    2
   B    9
   C    6
Z  A    3
   B    8
   C    0
dtype: int64